In [ ]:
a. Kindly fill the missing values with
1.value
2.Statistical value
3.Filling  method

B) Create pivot table for  position and average salary.
C) Group the data using group by as per gender  and average age.

In [1]:
import pandas as pd 
import numpy as np

In [66]:
df = pd.read_excel(r"C:\Users\heena\Downloads\ethnic_diversity.xlsx")

In [3]:
df

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450.0,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,NaN
2,"Steans, Tyrone",1302053333,Accountant I,MA,2703.0,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170.0,F,Married,US Citizen,Terminated for Cause,Admin Offices,NaN,44,White
4,"Singh, Nan",1307059817,Administrative Assistant,MA,2330.0,F,Single,US Citizen,Active,Admin Offices,61089.35,33,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...
305,"Daniele, Ann",1411071312,Sr. Network Engineer,CT,6033.0,F,Married,US Citizen,Leave of Absence,IT/IS,37619.01,38,White
306,"Lajiri, Jyoti",1108028108,Sr. Network Engineer,MA,2169.0,M,Married,US Citizen,Leave of Absence,IT/IS,27603.00,34,White
307,"Semizoglou, Jeremiah",904013591,Sr. Network Engineer,MA,1545.0,M,Married,US Citizen,Future Start,IT/IS,27587.46,24,Asian
308,"South, Joe",1308060959,Sr. Network Engineer,CT,6278.0,M,Single,US Citizen,Active,IT/IS,12126.53,31,White
309,"Warfield, Sarah",1301052347,Sr. Network Engineer,MA,2453.0,F,Widowed,US Citizen,Active,IT/IS,37257.00,46,Asian

In [4]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             3
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

# 1.value

In [5]:
# value or using domain knowledge

df["Position"].isnull().sum()

3

In [7]:
df['Position'].fillna("Accountant",inplace=True)

In [8]:
df["Position"].isnull().sum()

0

In [9]:
df["State"].isnull().sum()

2

In [10]:
df[df["State"].isnull()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
81,"Liebig, Ketsia",1103024679,Production Manager,NaN,2110.0,F,Married,US Citizen,Active,Production,28520.00,35,White
151,"Engdahl, Jean",1007020403,Accountant,NaN,2026.0,M,Single,US Citizen,Active,Production,49808.01,54,White

In [16]:
df["State"].mode()[0]

'MA'

In [19]:
df["State"].fillna(df["State"].mode()[0],inplace = True) # using mode for categorical data type or statistical measure mode

In [20]:
df["State"].isnull().sum()

0

In [68]:
df["Zip"].value_counts()

Zip
1886.0     13
1810.0      7
2045.0      7
2451.0      7
2176.0      7
           ..
2481.0      1
2908.0      1
78230.0     1
2493.0      1
6278.0      1
Name: count, Length: 157, dtype: int64

In [70]:
df["Zip"].fillna(1886.0,inplace = True)

In [71]:
df["Zip"].isna().sum()

0

In [72]:
df["Zip"][83]

1886.0

In [27]:
df["Gender"].fillna(method = "ffill", inplace = True) # using ffill method

C:\Users\heena\AppData\Local\Temp\ipykernel_15496\277194646.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Gender"].fillna(method = "ffill", inplace = True)

In [28]:
df["Gender"].isna().sum()

0

In [29]:
df["Gender"][146]

'F'

### Statistical value

In [38]:
df["MaritalDesc"].mode()[0]

'Single'

In [39]:
df["MaritalDesc"].fillna(df["MaritalDesc"].mode()[0],inplace = True) # using statistical method

In [40]:
df["MaritalDesc"].isnull().sum()

0

In [42]:
df["CitizenDesc"].fillna("indain citizenship",inplace = True)

In [43]:
df["CitizenDesc"].isna().sum()

0

In [44]:
df["Department"].fillna("IAS",inplace = True)

In [47]:
df["Department"].isnull().sum()

0

In [49]:
df["Salaries"].median() # its dosnt affected by the outlier

34554.744999999995

In [50]:
df["Salaries"].fillna(df["Salaries"].median(), inplace = True) # statistical value

In [53]:
df["Salaries"].isna().sum()

0

In [54]:
df["Race"].isnull().sum()

9

### Filling method

In [57]:
df["Race"].fillna(method = "ffill", inplace = True)

C:\Users\heena\AppData\Local\Temp\ipykernel_15496\361799192.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Race"].fillna(method = "ffill", inplace = True)

In [58]:
df["Race"].isnull().sum()

0

In [59]:
df.isna().sum()  # there are no missing values

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                0
dtype: int64

### B) Create pivot table for position and average salary.

In [61]:
df.head(2)

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450.0,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,Black or African American

In [64]:
df.pivot_table(values = "Salaries", index = "Position",aggfunc="mean")

                                  Salaries
Position
Accountant                    34387.906667
Accountant I                    674.280000
Administrative Assistant      42683.371667
Area Sales Manager            41770.737593
BI Developer                  36726.018750
BI Director                    4160.000000
CIO                           26418.010000
Data Analyst                  37772.945714
Data Analyst                  42304.750000
Data Architect                90016.010000
Database Administrator        33813.996000
Director of Operations        34554.745000
Director of Sales             27595.700000
Enterprise Architect           5802.000000
IT Director                   36741.000000
IT Manager - DB               49791.240000
IT Manager - Infra             8997.890000
IT Manager - Support           2143.580000
IT Support                    46885.221875
Network Engineer              35897.950000
President & CEO               52633.500000
Principal Data Architect      24828.700000
Production Manager            50297.552500
Production Technician I       35110.103383
Production Technician II      33803.863333
Sales Manager                 34093.246667
Senior BI Developer           71293.676667
Shared Services Manager       45262.975000
Software Engineer             39892.308889
Software Engineering Manager  40208.000000
Sr. Accountant                27349.755000
Sr. DBA                       31954.975000
Sr. Network Engineer          28438.600000

### Group the data using group by as per gender and average age.

In [65]:
df.groupby(by = "Gender")[["age"]].mean()

              age
Gender
F       38.659091
M       38.746269